; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v7 - type_3 ?v8 - type_2)
 	      (pred_3 ?v6 - object ?v8 - type_2)
	      (pred_2 ?v7 - type_3 ?v2 - type_1)
	      (pred_1 ?v7 - type_3 ?v6 - object ?v2 - type_1))

   (:action op_1
       :parameters  (?v7 - type_3 ?v1 ?v5 - type_2)
       :precondition (and  (pred_4 ?v7 ?v1))
       :effect (and  (pred_4 ?v7 ?v5)
		     (not (pred_4 ?v7 ?v1))))

   (:action op_3
       :parameters (?v7 - type_3 ?v3 - object ?v4 - type_2 ?v2 - type_1)
       :precondition  (and  (pred_3 ?v3 ?v4) (pred_4 ?v7 ?v4) (pred_2 ?v7 ?v2))
       :effect (and (pred_1 ?v7 ?v3 ?v2)
		    (not (pred_3 ?v3 ?v4)) 
		    (not (pred_2 ?v7 ?v2))))

   (:action op_2
       :parameters (?v7 - type_3 ?v3 - object ?v4 - type_2 ?v2 - type_1)
       :precondition  (and  (pred_1 ?v7 ?v3 ?v2) (pred_4 ?v7 ?v4))
       :effect (and (pred_3 ?v3 ?v4)
		    (pred_2 ?v7 ?v2)
		    (not (pred_1 ?v7 ?v3 ?v2)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_09 obj_06 - type_3
obj_10 obj_02 obj_04 obj_05 - type_1
obj_11 obj_07 obj_01 - type_2
obj_03 obj_08 - object)
(:init
(pred_4 obj_09 obj_01)
(pred_2 obj_09 obj_10)
(pred_2 obj_09 obj_02)
(pred_4 obj_06 obj_01)
(pred_2 obj_06 obj_04)
(pred_2 obj_06 obj_05)
(pred_3 obj_03 obj_11)
(pred_3 obj_08 obj_07)
)
(:goal
(and
(pred_3 obj_03 obj_01)
(pred_3 obj_08 obj_07)
)
)

(:constraints
  (always (not (pred_4 obj_09 obj_11)))
)
)

; plan
1. (op_1 obj_06 obj_01 obj_11)
   deleted: (pred_4 obj_06 obj_01)
   added: (pred_4 obj_06 obj_11)
   goals met: 1 of 2
2. (op_3 obj_06 obj_03 obj_11 obj_05)
   deleted: (pred_3 obj_03 obj_11) (pred_2 obj_06 obj_05)
   added: (pred_1 obj_06 obj_03 obj_05)
   goals met: 1 of 2
3. (op_1 obj_06 obj_11 obj_01)
   deleted: (pred_4 obj_06 obj_11)
   added: (pred_4 obj_06 obj_01)
   goals met: 1 of 2
4. (op_2 obj_06 obj_03 obj_01 obj_05)
   deleted: (pred_1 obj_06 obj_03 obj_05)
   added: (pred_3 obj_03 obj_01) (pred_2 obj_06 obj_05)
   goals met: 2 of 2
